# Import Packages

In [2]:
import pandas as pd
import numpy as np

In [3]:
# set user path
path = '/Users/chohasong/Desktop/streamlit_datasets/position_change/'

In [36]:
fitness_watch = pd.read_csv(path+'fitness_watch.csv')

In [12]:
fitness_watch[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,fitness_watch_5,0,149.95,4.3,14803
1,fitness_watch_8,1,220.89,4.4,5567
2,fitness_watch_4,2,79.95,4.3,18574
3,fitness_watch_1,3,24.99,4.9,563
4,fitness_watch_2,4,359.00,3.5,47
5,fitness_watch_6,5,28.99,4.2,135
6,fitness_watch_7,6,166.40,4.6,4241
7,fitness_watch_3,7,29.99,4.9,430

In [6]:
def random_position(df, seed):
    rng = np.random.default_rng(seed)   # change seed for a different shuffle
    n = len(df)

    new_pos = rng.permutation(n)       # 0..n-1 shuffled
    random_position = df.copy()
    random_position["assigned_position"] = new_pos
    random_position["position_in_experiment"] = new_pos  # keep same as assigned_position

    # optional: sort so the dataframe is in display order
    random_position = random_position.sort_values("assigned_position").reset_index(drop=True)

    return random_position

In [30]:
fitness_watch_random_position_1 = random_position(fitness_watch,43)

In [31]:
fitness_watch_random_position_1[['title','assigned_position','original_price','original_rating','original_rating_count']]

,title,assigned_position,original_price,original_rating,original_rating_count
0,"Garmin Forerunner 55, GPS Running Watch with D...",0,166.40,4.6,4241
1,WHOOP – 12-Month Membership – 5.0 Health and F...,1,359.00,3.5,47
2,"Garmin vívoactive 5, Health and Fitness GPS Sm...",2,220.89,4.4,5567
3,"Smart Watch with Alexa Built-in, 1.83"" HD Touc...",3,29.99,4.9,430
4,"Fitness Tracker with 24/7 Heart Rate, Blood Ox...",4,28.99,4.2,135
5,Fitbit Inspire 3 Health &-Fitness-Tracker with...,5,79.95,4.3,18574
6,"Smart Watch(Answer/Make Call), 1.91"" Smartwatc...",6,24.99,4.9,563
7,Fitbit Versa 4 Fitness Smartwatch with Daily R...,7,149.95,4.3,14803

In [ ]:
# fitness_watch_random_position_1.to_csv(path+'fitness_watch_random_position_1.csv')

In [26]:
fitness_watch_random_position_2 = random_position(fitness_watch,63)

In [32]:
fitness_watch_random_position_2[['title','assigned_position','original_price','original_rating','original_rating_count']]

,title,assigned_position,original_price,original_rating,original_rating_count
0,"Smart Watch with Alexa Built-in, 1.83"" HD Touc...",0,29.99,4.9,430
1,"Garmin Forerunner 55, GPS Running Watch with D...",1,166.40,4.6,4241
2,Fitbit Versa 4 Fitness Smartwatch with Daily R...,2,149.95,4.3,14803
3,"Garmin vívoactive 5, Health and Fitness GPS Sm...",3,220.89,4.4,5567
4,"Smart Watch(Answer/Make Call), 1.91"" Smartwatc...",4,24.99,4.9,563
5,"Fitness Tracker with 24/7 Heart Rate, Blood Ox...",5,28.99,4.2,135
6,Fitbit Inspire 3 Health &-Fitness-Tracker with...,6,79.95,4.3,18574
7,WHOOP – 12-Month Membership – 5.0 Health and F...,7,359.00,3.5,47

In [28]:
fitness_watch_random_position_2.to_csv(path+'fitness_watch_random_position_2.csv')

In [37]:
iphone_16_pro_cover = pd.read_csv(path+'iphone_16_pro_cover.csv')

In [38]:
iphone_16_pro_cover[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,iphone_sixteen_pro_cover_6,0,14.99,4.4,2030
1,iphone_sixteen_pro_cover_7,1,49.99,4.4,472
2,iphone_sixteen_pro_cover_4,2,12.99,4.6,109440
3,iphone_sixteen_pro_cover_3,3,7.99,4.5,15055
4,iphone_sixteen_pro_cover_1,4,16.95,4.3,108070
5,iphone_sixteen_pro_cover_2,5,9.99,4.6,10231
6,iphone_sixteen_pro_cover_8,6,9.99,4.7,14
7,iphone_sixteen_pro_cover_5,7,9.99,4.6,128228

In [39]:
iphone_16_pro_cover_random_position_1 = random_position(iphone_16_pro_cover,43)

In [41]:
iphone_16_pro_cover_random_position_1[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,iphone_sixteen_pro_cover_8,0,9.99,4.7,14
1,iphone_sixteen_pro_cover_1,1,16.95,4.3,108070
2,iphone_sixteen_pro_cover_7,2,49.99,4.4,472
3,iphone_sixteen_pro_cover_5,3,9.99,4.6,128228
4,iphone_sixteen_pro_cover_2,4,9.99,4.6,10231
5,iphone_sixteen_pro_cover_4,5,12.99,4.6,109440
6,iphone_sixteen_pro_cover_3,6,7.99,4.5,15055
7,iphone_sixteen_pro_cover_6,7,14.99,4.4,2030

In [42]:
iphone_16_pro_cover_random_position_2 = random_position(iphone_16_pro_cover,63)

In [43]:
iphone_16_pro_cover_random_position_2[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,iphone_sixteen_pro_cover_5,0,9.99,4.6,128228
1,iphone_sixteen_pro_cover_8,1,9.99,4.7,14
2,iphone_sixteen_pro_cover_6,2,14.99,4.4,2030
3,iphone_sixteen_pro_cover_7,3,49.99,4.4,472
4,iphone_sixteen_pro_cover_3,4,7.99,4.5,15055
5,iphone_sixteen_pro_cover_2,5,9.99,4.6,10231
6,iphone_sixteen_pro_cover_4,6,12.99,4.6,109440
7,iphone_sixteen_pro_cover_1,7,16.95,4.3,108070

In [44]:
iphone_16_pro_cover_random_position_1.to_csv('iphone_16_pro_cover_random_position_1.csv')
iphone_16_pro_cover_random_position_2.to_csv('iphone_16_pro_cover_random_position_2.csv')

In [4]:
mousepad = pd.read_csv(path+'mousepad.csv')

In [5]:
mousepad[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,mousepad_6,0,13.97,4.7,38896
1,mousepad_3,1,9.99,4.6,70816
2,mousepad_1,2,9.71,4.6,33033
3,mousepad_5,3,7.99,4.9,11
4,mousepad_8,4,9.99,4.6,13319
5,mousepad_7,5,24.99,4.7,100313
6,mousepad_4,6,8.49,4.6,29052
7,mousepad_2,7,7.99,4.6,2774

In [7]:
mousepad_random_position_1 = random_position(mousepad,43)

In [8]:
mousepad_random_position_1[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,mousepad_4,0,8.49,4.6,29052
1,mousepad_8,1,9.99,4.6,13319
2,mousepad_3,2,9.99,4.6,70816
3,mousepad_2,3,7.99,4.6,2774
4,mousepad_7,4,24.99,4.7,100313
5,mousepad_1,5,9.71,4.6,33033
6,mousepad_5,6,7.99,4.9,11
7,mousepad_6,7,13.97,4.7,38896

In [9]:
mousepad_random_position_2 = random_position(mousepad,63)

In [10]:
mousepad_random_position_2[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,mousepad_2,0,7.99,4.6,2774
1,mousepad_4,1,8.49,4.6,29052
2,mousepad_6,2,13.97,4.7,38896
3,mousepad_3,3,9.99,4.6,70816
4,mousepad_5,4,7.99,4.9,11
5,mousepad_7,5,24.99,4.7,100313
6,mousepad_1,6,9.71,4.6,33033
7,mousepad_8,7,9.99,4.6,13319

In [11]:
mousepad_random_position_1.to_csv('mousepad_random_position_1.csv')
mousepad_random_position_2.to_csv('mousepad_random_position_2.csv')

In [12]:
office_lamp = pd.read_csv(path+'office_lamp.csv')

In [15]:
office_lamp[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,office_lamp_4,0,29.99,4.4,919
1,office_lamp_2,1,39.99,4.8,1184
2,office_lamp_7,2,32.89,4.4,3682
3,office_lamp_6,3,59.99,4.6,9
4,office_lamp_1,4,39.99,4.5,6892
5,office_lamp_5,5,29.99,4.5,11241
6,office_lamp_8,6,18.99,4.3,8430
7,office_lamp_3,7,51.99,4.4,1207

In [13]:
office_lamp_random_position_1 = random_position(office_lamp,43)

In [16]:
office_lamp_random_position_1[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,office_lamp_8,0,18.99,4.3,8430
1,office_lamp_1,1,39.99,4.5,6892
2,office_lamp_2,2,39.99,4.8,1184
3,office_lamp_3,3,51.99,4.4,1207
4,office_lamp_5,4,29.99,4.5,11241
5,office_lamp_7,5,32.89,4.4,3682
6,office_lamp_6,6,59.99,4.6,9
7,office_lamp_4,7,29.99,4.4,919

In [17]:
office_lamp_random_position_2 = random_position(office_lamp,63)

In [18]:
office_lamp_random_position_2[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,office_lamp_3,0,51.99,4.4,1207
1,office_lamp_8,1,18.99,4.3,8430
2,office_lamp_4,2,29.99,4.4,919
3,office_lamp_2,3,39.99,4.8,1184
4,office_lamp_6,4,59.99,4.6,9
5,office_lamp_5,5,29.99,4.5,11241
6,office_lamp_7,6,32.89,4.4,3682
7,office_lamp_1,7,39.99,4.5,6892

In [19]:
office_lamp_random_position_1.to_csv('office_lamp_random_position_1.csv')
office_lamp_random_position_2.to_csv('office_lamp_random_position_2.csv')

In [20]:
stapler = pd.read_csv(path+'stapler.csv')

In [21]:
stapler_random_position_1 = random_position(stapler,43)

In [22]:
stapler_random_position_1[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,stapler_6,0,19.77,4.6,2008
1,stapler_7,1,22.84,3.6,1293
2,stapler_8,2,39.99,4.4,111
3,stapler_5,3,6.99,4.5,318
4,stapler_4,4,22.42,4.5,4127
5,stapler_1,5,6.73,4.6,51765
6,stapler_2,6,7.99,4.5,5418
7,stapler_3,7,6.99,4.7,713

In [23]:
stapler_random_position_2 = random_position(stapler,63)

In [24]:
stapler_random_position_2[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,stapler_5,0,6.99,4.5,318
1,stapler_6,1,19.77,4.6,2008
2,stapler_3,2,6.99,4.7,713
3,stapler_8,3,39.99,4.4,111
4,stapler_2,4,7.99,4.5,5418
5,stapler_4,5,22.42,4.5,4127
6,stapler_1,6,6.73,4.6,51765
7,stapler_7,7,22.84,3.6,1293

In [25]:
stapler_random_position_1.to_csv('stapler_random_position_1.csv')
stapler_random_position_2.to_csv('stapler_random_position_2.csv')

In [26]:
toilet_paper = pd.read_csv(path+'toilet_paper.csv')

In [27]:
toilet_paper_random_position_1 = random_position(toilet_paper,43)

In [29]:
toilet_paper_random_position_1[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,toilet_paper_3,0,35.49,4.8,29038
1,toilet_paper_6,1,25.21,4.4,77681
2,toilet_paper_7,2,12.49,4.7,68132
3,toilet_paper_8,3,27.59,4.7,106378
4,toilet_paper_1,4,14.00,4.6,19735
5,toilet_paper_5,5,5.68,4.5,84087
6,toilet_paper_2,6,35.49,4.8,111017
7,toilet_paper_4,7,59.99,4.6,36399

In [30]:
toilet_paper_random_position_2 = random_position(toilet_paper,63)

In [31]:
toilet_paper_random_position_2[['sku','assigned_position','original_price','original_rating','original_rating_count']]

,sku,assigned_position,original_price,original_rating,original_rating_count
0,toilet_paper_8,0,27.59,4.7,106378
1,toilet_paper_3,1,35.49,4.8,29038
2,toilet_paper_4,2,59.99,4.6,36399
3,toilet_paper_7,3,12.49,4.7,68132
4,toilet_paper_2,4,35.49,4.8,111017
5,toilet_paper_1,5,14.00,4.6,19735
6,toilet_paper_5,6,5.68,4.5,84087
7,toilet_paper_6,7,25.21,4.4,77681

In [32]:
toilet_paper_random_position_1.to_csv('toilet_paper_random_position_1.csv')
toilet_paper_random_position_2.to_csv('toilet_paper_random_position_2.csv')

In [33]:
toothpaste = pd.read_csv(path+'toothpaste.csv')

In [34]:
toothpaste_random_position_1 = random_position(toothpaste,43)

In [35]:
toothpaste_random_position_2 = random_position(toothpaste,63)

In [36]:
toothpaste_random_position_1.to_csv('toothpaste_random_position_1.csv')
toothpaste_random_position_2.to_csv('toothpaste_random_position_2.csv')

In [37]:
washing_machine = pd.read_csv(path+'washing_machine.csv')

In [38]:
washing_machine_random_position_1 = random_position(washing_machine,43)

In [39]:
washing_machine_random_position_2 = random_position(washing_machine,63)

In [40]:
washing_machine_random_position_1.to_csv('washing_machine_random_position_1.csv')
washing_machine_random_position_2.to_csv('washing_machine_random_position_2.csv')